[{  
   "developer_bio":null,
   "project_count":"0",
   "developer_org_logo":"https://avatars3.githubusercontent.com/u/14337040?s=70&v=4",
   "contributor_count":"1",
   "developer_id":"rodrigoberriel",
   "readme_text":"Automatic Large-Scale Data Acquisition via Crowdsourcing for Crosswalk Classification: A Deep Learning ApproachRodrigo F. Berriel, Franco Schmidt Rossi, Alberto F. de Souza, and Thiago Oliveira-SantosComputers & Graphics: 10.1016/J.CAG.2017.08.004Correctly identifying crosswalks is an essential task for the driving activity and mobility autonomy. Many crosswalk classification, detection and localization systems have been proposed in the literature over the years. These systems use different perspectives to tackle the crosswalk classification problem: satellite imagery, cockpit view (from the top of a car or behind the windshield), and pedestrian perspective. Most of the works in the literature are designed and evaluated using small and local datasets, i.e. datasets that present low diversity. Scaling to large datasets imposes a challenge for the annotation procedure. Moreover, there is still need for cross-database experiments in the literature because it is usually hard to collect the data in the same place and conditions of the final application. In this paper, we present a crosswalk classification system based on deep learning. For that, crowdsourcing platforms, such as OpenStreetMap and Google Street View, are exploited to enable automatic training via automatic acquisition and annotation of a large-scale database. Additionally, this work proposes a comparison study of models trained using fully-automatic data acquisition and annotation against models that were partially annotated. Cross-database experiments were also included in the experimentation to show that the proposed methods enable use with real world applications. Our results show that the model trained on the fully-automatic database achieved high overall accuracy (94.12%), and that a statistically significant improvement (to 96.30%) can be achieved by manually annotating a specific part of the database. Finally, the results of the cross-database experiments show that both models are robust to the many variations of image and scenarios, presenting a consistent behavior.Test with your own dataPre-trained models are available here.This Python notebook may help you with the inference process.DatasetsWe are releasing three datasets: IARA (day and night) and GOPRO. The IARA datasets were recorded using the infrastructure of the IARA autonomous car (which we are developing in our lab), and the GOPRO dataset was recorded using a GOPRO camera attached to the windshield (close to the rear mirror). Altogether, these three datasets have more than 35,000 annotated images. More details can be found in the paper. Below, you can see some samples of the datasets and how to download each of them.IARA datasetDaylightDetails and download here.Results on the IARA dataset: video.NightDetails and download here.Results on the NIGHT dataset: video.GOPRO datasetDetails and download here.Results on the GOPRO dataset: video.BibTeXIf you find any of the datasets and/or our pre-trained models useful for your research, please cite the paper below.@article{berriel2017cag,  Author = {Rodrigo F. Berriel and Franco Schmidt Rossi and Alberto F. de Souza and Thiago Oliveira-Santos},  Title  = {{Automatic Large-Scale Data Acquisition via Crowdsourcing for Crosswalk Classification: A Deep Learning Approach}},  Journal = {Computers \\& Graphics},  Year  = {2017},  Volume = {68},  Pages  = {32--42},  DOI   = {10.1016/J.CAG.2017.08.004},  ISSN  = {0097-8493},}If any link is broken, feel free to send me an email or open an issue.",
   "developer_org":" ",
   "star_count":"2",
   "developer_name":"Rodrigo Berriel",
   "developer_photo":"https://avatars1.githubusercontent.com/u/7027770?s=460&v=4",
   "issue_count":"0",
   "repo_name":"streetview-crosswalk-classification",
   "developer_location":"Brazil",
   "release_count":"0",
   "developer_bio_links":null,
   "repo_description":"Automatic Large-Scale Data Acquisition via Crowdsourcing for Crosswalk Classification: A Deep Learning Approach",
   "branches_count":"1",
   "forked_count":"0",
   "number_of_watches":"",
   "repo_tags":"",
   "repo_link":"https://github.com/rodrigoberriel/streetview-crosswalk-classification",
   "commits_count":"2",
   "pull_count":"0",
   "arxivIds" :["0712.1869"]
}]